{"Title": "Extract specific vertices", "Abstract": "This algorithm takes a line or polygon layer and generates a point layer with points representing specific vertices in the input lines or polygons. For instance, this algorithm can be used to extract the first or last vertices in the geometry. The attributes associated to each point are the same ones associated to the line or polygon that the point belongs to.\n\nThe vertex indices parameter accepts a comma separated string specifying the indices of the vertices to extract. The first vertex corresponds to an index of 0, the second vertex has an index of 1, etc. Negative indices can be used to find vertices at the end of the geometry, e.g., an index of -1 corresponds to the last vertex, -2 corresponds to the second last vertex, etc.\n\nAdditional fields are added to the points indicating the specific vertex position (e.g., 0, -1, etc), the original vertex index, the vertex’s part and its index within the part (as well as its ring for polygons), distance along the original geometry and bisector angle of vertex for the original geometry.", "Identifier": "native:extractspecificvertices", "Input": [[{"Title": "INPUT"}, {"Abstract": "Input layer"}, {"Identifier": "INPUT"}, {"Parameter type": "QgsProcessingParameterFeatureSource"}, {"Accepted data types": [{"str": "layer ID"}, {"str": "layer name"}, {"str": "layer source"}, "QgsProcessingFeatureSourceDefinition", "QgsProperty", "QgsVectorLayer"]}], [{"Title": "VERTICES"}, {"Abstract": "Vertex indices"}, {"Identifier": "VERTICES"}, {"Parameter type": "QgsProcessingParameterString"}, {"Accepted data types": ["str", "QgsProperty"]}], [{"Title": "OUTPUT"}, {"Abstract": "Vertices"}, {"Identifier": "OUTPUT"}, {"Parameter type": "QgsProcessingParameterFeatureSink"}, {"Accepted data types": [{"str": "destination vector file, e.g. 'd:/test.shp'"}, {"str": "'memory:' to store result in temporary memory layer"}, {"str": "using vector provider ID prefix and destination URI, e.g. 'postgres:…' to store result in PostGIS table"}, "QgsProcessingOutputLayerDefinition", "QgsProperty"]}]], "Outputs": [{"Title": "OUTPUT"}, {"Abstract": "Vertices"}, {"Parameter type": "QgsProcessingOutputVectorLayer"}]}